%d=9
%list=zeros(1,d);
list=zeros(1,9);
j=0;
%n=πλήθος ρίψεων
for n=[10,20,50,100,500,1000,5000,10000,50000]
    %for i=1:15
    %  n=2^i;   εκθετική αύξηση των τυχαίων ρίψεων
    ni=0; %φορες που ετυχε γραμματα
    for i=1:n
        x=rand;
        if x<0.5
            ni=ni+1;
        end
    end
    f=ni/n; %αναλογία των γραμμάτων για n επαναλήψεις
    j=j+1;
    list(j)=f;
end
x=categorical({'10','20','50','100','500','1000','5000','10000','50000'});
x=reordercats(x,{'10','20','50','100','500','1000','5000','10000','50000'});
figure('Name','Άσκηση 1')
%clf clear figure
bar(x,list,0.2,'k')
ylim([0 1])
xlabel('Πλήθος ρίψεων n')
ylabel('Αναλογία "γραμμάτων" ni/n')
