list=zeros(10,2); %Πρώτη στήλη 1/Ε[Χ], δευτερη στήλη Ε[1/Χ]
j=0;
for n=[10,50,100,200,500,1000,5000,10000,50000,100000]
    listx=zeros(1,n);
    list1x=zeros(1,n);
    for i=1:n
        Y=rand;
        X=1+Y; %Τυχαίοι απο ομοιομορφη κατανομη [1,2]
        listx(i)=X;
        list1x(i)=1/X;
    end
    j=j+1;
    list(j,1)=1/mean(listx);
    list(j,2)=mean(list1x);
end
x=categorical({'10','50','100','200','500','1000','5000','10000','50000','100000'});
x=reordercats(x,{'10','50','100','200','500','1000','5000','10000','50000','100000'});
figure('Name','Άσκηση 4:[1,2]')
b=bar(x,list);
xlabel('Πλήθος επαναλήψεων n')
ylabel('Μέσοι όροι')
ylim([0 0.7])
legend('1/E[X]','E[1/X]')
disp('Συμπέρασμα: Δεν ισχύει η σχέση 1/E[X]=E[1/X]')

%Περιπτωσή [0,1]
list=zeros(10,2); 
j=0;
for n=[10,50,100,200,500,1000,5000,10000,50000,100000]
    listx=zeros(1,n);
    list1x=zeros(1,n);
    for i=1:n
        X=rand;
        listx(i)=X;
        list1x(i)=1/X;
    end
    j=j+1;
    list(j,1)=1/mean(listx);
    list(j,2)=mean(list1x);
end
x=categorical({'10','50','100','200','500','1000','5000','10000','50000','100000'});
x=reordercats(x,{'10','50','100','200','500','1000','5000','10000','50000','100000'});
figure('Name','Άσκηση 4:[0,1]')
b1=bar(x,list);
xlabel('Πλήθος επαναλήψεων n')
ylabel('Μέσοι όροι')
legend('1/E[X]','E[1/X]')

%Περιπτωσή [-1,1]
list=zeros(10,2); %Πρώτη στήλη 1/Ε[Χ], δευτερη στήλη Ε[1/Χ]
j=0;
for n=[10,50,100,200,500,1000,5000,10000,50000,100000]
    listx=zeros(1,n);
    list1x=zeros(1,n);
    for i=1:n
        Y=rand;
        X=2Y-1;
        listx(i)=X;
        list1x(i)=1/X;
    end
    j=j+1;
    list(j,1)=1/mean(listx);
    list(j,2)=mean(list1x);
end
x=categorical({'10','50','100','200','500','1000','5000','10000','50000','100000'});
x=reordercats(x,{'10','50','100','200','500','1000','5000','10000','50000','100000'});
figure('Name','Άσκηση 4:[-1,1]')
b2=bar(x,list);
xlabel('Πλήθος επαναλήψεων n')
ylabel('Μέσοι όροι')
legend('1/E[X]','E[1/X]')